<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>友情链接交换中的三种另类欺骗方式-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="网站优化,网络，友情链接" />
<meta name="description" content="友情连接的价值除了体现在提高网站PR和流量的以外，还体现在“友情”二字上， 所谓友情连接，站长之间一种平等互换的关系，彼此信任，互相交换，共同提高！然而总有某些人存有暗黑的心理，只知索取却不知奉献" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>友情链接交换中的三种另类欺骗方式</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 网站优化分析,友情链接</em>
			<p>友情连接的价值除了体现在提高网站PR和流量的以外，还体现在“友情”二字上， 所谓友情连接，站长之间一种平等互换的关系，彼此信任，互相交换，共同提高！然而总有某些人存有暗黑的心理，只知索取却不知奉献，采用各种各样的方法来欺骗其他站长，为连接市场抹黑，自己躲在背后卑怯的偷笑！</p>
			<p>常见的欺骗方式相信大家在A5或者其他站长站上都见过，比如JS连接，框架连接，删除连接，隐藏连接等等，目前因为这些害群之马的胡作非为，大部分站长已经对此有所戒备，而且网上也有很多免费的友情连接检测工具可以来检测！下面总结的三种方法不太常见，在各个站长论坛遇到后总结出来的，其技术非常高明，让很多站长不容易发现！</p>
			<p>1：针对搜索引擎蜘蛛隐藏所有外部连接！</p>
			<p>这种方法大部分的站长都很难发现，其做法是写一段代码专门针对搜索引擎蜘蛛，当判断为蜘蛛来访时，则隐藏掉所有的外部连接，也就是蜘蛛判断此站无导出连接，而当用户通过浏览器进入站点时，则可以看到连接放在那！这样就导致了别人给他的连接对于搜索引擎来说，全部都是单向连接，提高自己的网站排名和PR，却害得和他换连接的站长们还以为得了个宝！</p>
			<p>2：利用代码判断来源站点进行作弊！</p>
			<p>这种方法前段时间在点石论坛上有人提到过！这种方法利用的就是一般站长在检查连接时，都是从自己的站点上点击其他站点，然后查看其他站点上是否有自己的连接！某些人就利用这一点写一段代码进行判断，如果判断来源为你的站点，则在网页上显示出你的连接，如果来源是其他站点，则显示其他站点！这样的话，每次你从自己的站点点过去查看的时候，都会看到自己的站点连在那，很难察觉到作弊！然而对于搜索引擎来说，他的站一个导出连接都没有，其他站点都在免费给他做单项连接！</p>
			<p>3：利用钓鱼原理，用一个及其相似的域名做更多连接！</p>
			<p>这种方法是落伍的朋友发现的！大家还即得前几年那个工商银行钓鱼的案例吧，有人申请了个域名1cbc, 这和icbc非常相似，稍有疏忽就以为是真的！在友情连接市场上，很多站点都有一个“更多连接”的页面，然后很多连接都放在这个“更多连接”的单独页面上！某些别有用心的人则利用站长的疏忽，申请一个和自己主站极其相似的域名，专门来放这些“更多连接”， 站长不小心的话还以为是主站里的页面，其实是一个豪无意义的垃圾域名和垃圾页面，没有任何权重，免费为别人做了个单向连接还被蒙在鼓里！</p>
			<p>目前我收集到的就有这三种！如果还有其他的，还希望大家能补充！</p>
			<p>俗话说：害人之心不可用，但防人之心不可无！大部分站长都是诚实的，不仅连接，而且友情！但总会有那么些害群之马躲在背后伺机骗人！这种人的心理我们无法分析，毕竟站长不是心理学家，但总结一点：肮脏，黑暗！某些人还扯着网络的幌子为自己遮盖，其实这些人和现实生活中的骗子没有两样，绞尽脑汁的去欺骗别人为自己牟利，属于同一个性质！不管是现实中的骗，还是网络中的骗， 都是骗！</p>
			<p>同时也提醒大家，在交换连接的时候一定要查清楚对方站点的情况，不要被某些人开出的优厚条件所蒙骗，大家做站都不容易，如果被骗的话都挺不好过的，也希望高手们能开发出功能更加强劲的检测工具，来帮助站长们来防范这些欺骗，把这些骗子们赶出连接市场！</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>