<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>核心关键词该如何定位？-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="SEO网站优化,核心关键字" />
<meta name="description" content="从搜索引擎输入关键字段来寻找想要的信息。关键词成了我们在搜索引擎中查找信息的最佳，也是唯一手段。继而，网站关键词的优化将在网站推广中占有举足轻重的地位。" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>核心关键词该如何定位？</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 关键词深度挖掘</em>
			<p>我们在网上寻找信息都是从搜索引擎输入关键字段来寻找想要的信息。关键词成了我们在搜索引擎中查找信息的最佳，也是唯一手段。继而，网站关键词的优化将在网站推广中占有举足轻重的地位。那么，我们一个企业应该怎么去选择关键词呢?</p>
			<p>1、站在客户的角度考虑</p>
			<p>潜在客户在搜索你的产品时将使用什么关键词?这可从众多资源中获得反馈，包括从你的客户、供应商那里获知其想法。 只有得知了客户需要什么样的关键词，我们才能有的放矢，确定好关键词。</p>
			<p>2、将关键词扩展成一系列短语</p>
			<p>选择好一系列短语后，可用网络营销软件对这些关键词组进行检测，软件的功能是查看你的关键词在其它网页的使用频率，以及在过去24小时内各大搜索引擎上有多少人在搜索时使用过这些关键词。最好的关键词是那些没有被滥用而又很流行的词。</p>
			<p>3、进行多重排列组合</p>
			<p>改变短语中的次序以创建不同的词语组合。使用不常用的组合，组合成一个问句。包含同义词、替换词、比喻词和常见错拼词。包含所卖产品的商标名和品名。使用其他限定词来创建更多的两字组合，三字，四字组合。</p>
			<p>例如，如果你的关键词是赚钱，你可能遇到象广告赚钱，网络赚钱，网站赚钱，等等词组。如果关键词是软件解决方案，不防试试流量分析软件解决方案，流量分析报告，流量报告工具，B2B软件解决方案，电子商务软件解决方案，等等。需要注意的是，关键词组不一定有意义，虽然在你进行组合时，它们必须具备相关含义。</p>
			<p>4、使用专业概念词汇来限定来访者</p>
			<p>明确你关键词组的概念，如电子商务软件。要做到够明确专业以使词组不至于太宽泛，如电子商务软件解决方案，电子商务安全解决方案，B2B电子商务软件，等等。</p>
			<p>5、使用地理位置</p>
			<p>如果你的位置很关键，则把它加入你的关键词组。例如，广州SEO培训，这里，广州SEO培训就是一个很有用的关键词。</p>
			<p>6、回顾竞争者使用的关键词</p>
			<p>查寻竞争者的关键词可让你想到一些你可能漏掉的词组。但不要照抄任何人的关键词，因为你并不清楚他们如何使用这些关键词--你得自己想关键词。寻找别人的关键词只是你对已经选好的关键词的补充。</p>
			<p>7、勿用意义太烦的词和短语</p>
			<p>要用修饰词将普通词汇和短语意义变得更为精确。如提供SEO的站点可以使用SEO培训、SEO信息、SEO优化等关键词组</p>
			<p>为了预先预定来访者，关键词和短语应明确你的利基。如果你是从事IT业、娱乐业，则用娱乐新闻、影片追踪、明星故事娱乐中心等等。明确利基可吸引你需要的访问者。不管你销售什么，这一点都相当重要。一群小小的目标受众比一大群以为你在卖其它什么东西的来访者更有可能转化成真正的客户。 SEO信息传播网就是采用这种思想做起来的。</p>
			<p>8、勿用单词汇</p>
			<p>多次短语比单一词汇更有用。搜索引擎很难就单一词汇搜索相关结果，因为这样的搜索的条件会产生太多的结果，而搜索者是不会去浏览数百个结果页面的。一个搜索拍卖网站电子商务解决方案的用户不会只搜索软件。</p>
			<p>这些策略将帮助你瞄准合格的来访者。关键词选择在搜索引擎营销中是最重要的工作之一，花时间去做好他，你的店铺的流量可能在你的不知不觉中就提高了。</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>
