<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>网站关键词优化出众却没有盈利的两个问题-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="SEO网站优化,网站关键词" />
<meta name="description" content="分析一个网站的优化问题，第一点就是要分析这个网站的关键字和对应关键字的排名了，如果一个关键词优化没有问题，那么一定就是这个关键字本身出了问题。" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>网站关键词优化出众却没有盈利的两个问题</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 关键词深度挖掘</em>
			<p>一、你的所选的关键字经过仔细的考虑了吗？</p>
			<p>分析一个网站的盈利问题，第一点就是要分析这个网站的关键字和这些关键字的排名了，如果一个关键词优化没有问题，那么一定就是这个关键字本身出了问题。首先从关键词优化上说，一个关键字的排名不能仅仅看一个关键字的自然排名，还要看有多少人在做这个关键的竞价排名，一般我们认为如果一个关键字超过8 家在做竞价排名的话，再进行SEO的价值就不大了，因为从用户的角度而言，用户是不会区分你是自然排名的第一还是竞价排名的第一的，他们只会留意排名靠前 的网站，而自然排名必然排在所有竞价排名之下，那就意味着你能从这个关键字上获取的流量非常有效，而且众多竞价排名也意味着这个关键字竞争激烈，所以我们 认为这种关键字性价比较差，不建议操作。</p>
			<p>另外就是没有太多的竞价，而且关键排名也不错，那么就要看关键字品质了，您所操作的关键字所含的用户购买意向到底有多少，我举一个例子来进行说明，大 家都知道减肥是一个利润丰厚的行业，能举得这种关键字良好的排名基本就意味着获利。但是关键字之间还是有差异的，这就是关键字包含的产品购买意向的差异， 或者我们可以称之为关键字含金量。以健康减肥和快速减肥这两个关键字为例来说，我个人认为快速减肥这个关键字具有更高的含金量。因为搜索健康减肥的用户更 多关注的健康，也就是说他们的减肥迫切程度并不是很强，而搜索快速减肥的用户的产品需求迫切程度则要远远高于减肥，那么您说哪个关键更利于促成产品的销售 呢，我想答案是显而易见的。</p>
			<p>二、你的网站有盈利点吗？</p>
			<p>如果你的关键字有排名不错，而且认为关键字的含金量也足够的话，我个人认为你的站至少会有一些基本的盈利，但是很多站长会反映，哎，网站的盈利比我想象的要差太多了，其实这正是我这篇文章想要谈论的重点。在上篇网站要站在用户的角度考虑网站体验的文章中，我以对痘痘去去网的反思为例阐释了用户体验的重要性，那么在这篇文章中我要继续明确一点，每一个站长都应该问这样一句话，“我的网站有盈利点吗？”或者是“我网站的盈利点 准确的围绕着我的目标转化率吗？”，我想如果您的回答是肯定的，而您又有着不错的关键词优化的话，那么您现在一定获利丰厚。</p>
			<p>网站的盈利点没有固定的模式，也不可能有一种固定的模式，但一定会有不好的模式，差的模式，不赚钱的模式和让人嗤之以鼻大叹幼稚的模式。我们以大卖场为例来进行说明。</p>
			<p>有时候大卖场会组织较大的团购会或者展销会，我们叫做中心盈利模式。也就是说网站的流量基本被吸引到这几个中心中，而这个中心又拥有非常好的用户转化率，整个网站的盈利的基础就建立在这个中心的转化率上，只要经营好了这个中心就意味着整个网站举得了胜利。</p>
			<p>或者类似与大卖场的导购制，大家经常会看到一些售货小姐进行一些产品的展示，对用户进行导购，我们称之为软文引导式，通过软文，转嫁其他用户的良好的消费体验以促成消费。我想很多很多软文高手看到这里就会心一笑了。</p>
			<p>另外还有展柜位置法。大家如果了解大卖场的话就知道，不同的展柜位置价位是不一样的，同样，内容在网站的位置也是十分关键的，既要不影响用户体验，又要最大限度的提升网站的盈利转化，站长朋友们，你们对自己的网站认证规划过吗，现在网站内容的摆放真的合理吗？</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>
