<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>网站优化与SEO的误区-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="网站优化,网络，SEO" />
<meta name="description" content="关键词的选择，网站页面的设计，网站框架的架构，关键词和网页描述，网站内容的定位和完善等多方面入手，SEO并不仅仅是要了解搜索引擎优化的原理，懂得这项技术，而是要将技术和艺术，实用和美观一次又一次地完美结合，需要用心去构思，并细心地跟踪处理每一个细节" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>网站优化与SEO的误区</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 网站优化分析，网站优化</em>
			<p>在网站优化与SEO(Search Engine Optimization : 搜索引擎优化)方面，总有许多似是而非的说法，相信朋友们都曾或多或少地听说过类似的论断，这之中，有些属于之前正确但随着搜索引擎算法的调整不再有效甚至对SEO效果有害的一类，有些属于对网站排名分析方法的不正确或不完善而得出的错误结论，当然，也有些则属彻头彻尾的胡说八道——这方面，很多国产SEO专家功不可没，至于这些SEO专家缘何作出那样的论断则不好评断：如果说他们有意误导，似乎有从人格上否定他们的嫌疑；如果说他们是无心之失，则无疑于从侧面指责他们不学无术，毕竟，如果说当年鲁迅先生认为“中医不过是一种有意或无意的骗子”时，还可用当时科学不发达，大多中医不懂人体的基本构造与病理机制来用“无意”开脱的话，对吃SEO这碗饭的专家们也用“无意”来解释就有点搞笑了，特别考虑到令人顿生高山仰止之感的吓人名头与长得绝对需要换几口气才能读完的头衔。</p>
			<p>有点扯远了，下面简要归纳一下笔者常见的网站优化与SEO中的误区：</p>
			<p>SEO很简单</p>
			<p>这一点常常见诸于SEO初学者的口中，许多人往往把调整一下Html的Meta项、提高一下关键词密度称之为SEO，并据此认为SEO不过如此耳耳，此言谬矣！从根本上说，SEO是一项相当复杂、精细的工作，成功的SEO涉及网站建设从网站品牌的确立到ROI (Return on Investment)方方面面，是多种技术、技巧的综合，将SEO想得过于简单化只能是一厢情愿。</p>
			<p>也许，我们可以假设一下，如果SEO很简单，那么，是不是意味着SEO容易取得成功？这就出现了一个问题：搜索引擎如何在搜索结果页面的第一页或第三页摆下这么多“成功实施SEO”的网站/网页？</p>
			<p>成功的SEO意味着在搜索引擎中取得领先于竞争对手的优势，这并不是一件简单的事。</p>
			<p>搜索引擎反对SEO</p>
			<p>不少人认为搜索引擎与SEO之间是相互对立的关系，认为SEO的目的便是意图破坏搜索结果的公正与有效，这种说法在一定范围内很有市场。</p>
			<p>不过，对此要客观地认识，首先，不要将SEO与Spam混为一谈，对于那些通过抄袭别人内容、关键词填充甚至隐形文本的Spammer，搜索引擎肯定是要打击的；其次，从根本上说，SEO与搜索引擎有一个共同的目标，那便是如何有效地组织内容，帮助用户以最有效的方式找到所需的内容，从这个角度，搜索引擎与SEO更像是一种相互储存相互补充的共生关系。</p>
			<p>具有优秀内容的网站不需SEO</p>
			<p>任何时候，内容都是SEO的基础，但是，内容只是SEO成功与否的必要条件而非充分条件，也即是说，内容本身并不能保证网站能够在搜索引擎占据有利的地位。这一点，我们在SEO与网站内容质量的诡辩已进行过详细的探讨，不再赘述。</p>
			<p>其实，类比一下也很好理解，比如说，从某种角度可以将网站的内容等同于传统行业中企业的产品，那么，产品本身的优秀能够决定其最终的市场占有率或销量么？答案很明显：即使是一款垃圾产品只要包装、宣传得力，也可能会取得神话般的成功，就象脑白金之类东西也能风靡大江南北一样。——当然，这么说不是暗喻SEO或网站优化也要像脑白金学习，毕竟，骗子要取得成功，除了骗子自身要有大智慧，要有虽千万人吾独往矣的大无畏气概外，也要有嗷嗷待骗的广大受众群做保障，而在SEO或搜索引擎界，这一条件很难满足：比如说Google一贯号称“Google is always a lot smarter than you”，而Baidu的聪明人据说也越来越多了。</p>
			<p>SEO没有技术含量或SEO需要高深的技术</p>
			<p>SEO究竟有没有技术含量？从某些角度，可以用人们常用来评价“金钱”那句话来解释：技术不能万能的，但没有技术的SEO是不可能成功的。神化或弱化SEO中的技术成分都有所偏颇。</p>
			<p>其实，分析一下某些人为什么提出这类论点可以让我们更清楚地看清SEO有无技术含量这个问题的实质：很多从以前的广告或策划公司转向SEO行业的人，往往嘴皮子笔头功夫尚可，很多时候洋洋洒洒数千字甚至数万字的方案虽无新意但尚可自圆其说，其必须避开自己在技术上的劣势；而技术人员的出身的SEO业者则往往沉溺于技术而在整体把握上有所匮乏，也必须要强调自己的优势。究其根源，都是在寻找己之长以及人之短。</p>
			<p>为什么网站优化后排名没有上升</p>
			<p>很多时候，也许需要的只是时间。时间与耐心是SEO成功与否最重要因素，无论在针对Google的SEO还是针对Yahoo的SEO中，时间因素都是一个相当重要的因素，即使是对时间因素权值较低的Live Search的优化效果，也不是能够立即体现出来的。</p>
			<p>记住SEO的传统格言：耐心是最大的美德！</p>
			<p>也可以换位思考一下，从搜索引擎的角度考虑SEO：如果你是搜索引擎，你会让一个刚冒出来的网站排在前面么？或者，您会让一些刚建立的链接在多大程度上影响最终的排名？</p>
			<p>SEO企业或SEO工具的保证排名宣传</p>
			<p>我们都喜欢购买放心的产品或服务，而“保证”则往往是让我们放松警惕的有效手段，很多情况下，敢于“保证”往往蕴含着背后强大的技术能力或丰富的经验，让人刮目相看。但是，也必须清醒地看到，所谓的“保证”在也许只是一种销售策略。</p>
			<p>在很多时候，以一定的技术为保障，经验丰富的SEO人员能够让相应的网站/网页获得预期的排名，但是，没人能真正保证在不可知的未来也能做到这一点。——谁也无法确知搜索引擎的算法在下一次更新时将做如何调整。——SEO在某种程度上与股票市场类似，正如没人能准确掌握股票未来的走向那样，也没人确知搜索引擎下一步将如何变化。从这个角度看，只有搜索引擎自身才具有决定网站排名的权力。</p>
			<p>如果您要的是“保证排名”的效果，也许您应考虑竞价排名，而不是这些SEO企业或SEO工具。</p>
			<p>另一方面，对于这些信誓旦旦做保证的企业，您应更谨慎一些：他们是否会采取某些搜索引擎深恶痛绝的spam手段？是否从长期来看会对您的网站造成很难挽回的伤害？他们保证排名位置的关键词是什么？事实上，如果选择一个没人使用的关键词，通过添加相应的内容页面、进行简单的优化、建立必要的链接等，也许即便傻瓜也能做到排名第一的位置，但那样有意义么？</p>
			<p>同样的保证，也许有的可以让你达到预期的效果，有的则让你的网站彻底从搜索引擎中消失。</p>
			<p>稳定的排名</p>
			<p>SEO的目标就是获得排名第一的位置或尽可能多的访问量</p>
			<p>人人都希望这是真的，尤其在道德感缺失的SEO行业，但很多时候，事实并不那么乐观。很多的例子表明，恶意的竞争对手还是能够通过某些方式伤害您的网站的。</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>