<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>网站优化应该循序渐进-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="网站优化,网络，SEO" />
<meta name="description" content="关键词的选择，网站页面的设计，网站框架的架构，关键词和网页描述，网站内容的定位和完善等多方面入手，SEO并不仅仅是要了解搜索引擎优化的原理，懂得这项技术，而是要将技术和艺术，实用和美观一次又一次地完美结合，需要用心去构思，并细心地跟踪处理每一个细节" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>网站优化应该循序渐进</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 网站优化分析</em>
			<p>一、懵懂入门</p>
			<p>可能很多不熟悉或者刚入门的新手都会有这样的体会：SEO很高深，很难学，技术要求很高。</p>
			<p>一开始接触搜索引擎优化的东西时，只知道原来搜索出来的结果是可以人为去干预的，觉得很不可思议，原来做网站，网站优化还有这么多东西需要学习。后来看了一些搜索引擎优化的书，这段时间对SEO进行比较系统地了解。说实话刚开始接触的时候，是有点懵懂，好像明白了又好像不太明白是咋回事。</p>
			<p>发现国内很多懂SEO知识的人基本上是自学的，有的可能会去听讲座，或者参加一些收费的培训课程，但是都是断断续续并且不成体系地学习。从知名站点，SEO论坛，专家博客，搜索引擎官方博客上获取一些技术方法或者最新的信息内容。</p>
			<p>建议：刚入门或者想要学习SEO的同志们先找一些基础全面的书籍或者网上的课程进行学习。</p>
			<p>个人觉得，分板块，分类别，并且有计划地学习效果不错，比如按周期对网页设计的优化学习，关键词优化学习，网站内容优化，网站链接等逐渐进行了解和运用。</p>
			<p>二、学习SEO成为习惯</p>
			<p>当一件事经常持续的话，就容易形成一种习惯。对搜索引擎优化的相关知识有所了解后，打开一个网站的第一件事，习惯性地看pr值，再看网站的整体架构，友情链接，以及网站的更新频率和内容等。</p>
			<p>观察搜索关键词后的排名变化，对比每个站点对关键词和标题的描述。这段时间结识了一些SEO行家，听了不少同行高手的金玉良言，这个时候还局限于不断地搜集学习资料，满足于对关键词选择，网站内容要怎么做好，怎样增加网站外部链接等一些基础理论知识。</p>
			<p>SEO已经生活化，从事网络和it行业的人可能更深有感触。滴水穿石，学习靠不断积累，这句话我们在上学的时候可能听过了无数遍，最近在整理友情链接工作时更发现积累力量的强大，原来无意间加了那么多链接网站。真的是很惊讶和感叹!</p>
			<p>三、在实践中前进</p>
			<p>当你获得一定理论知识后，就不会满足于只是知道怎么做，而是要去实现这个操作，并获得实验的结果。通过交换友情链接、写博客、增加原创内容、增加网站外部链接、改变关键词和网页描述等等实践措施寻求期待的结果。</p>
			<p>但总是觉得做的不够，继续混迹在各大SEO站点、论坛和博客之间，寻找最新消息，看高手们有没有新的研究和经验，这个时候脑子开始混乱。正处于茫然状态的时候，无意间浏览了google黑板报中文博客上一些文章后，思路开始清晰。建站的目的是为用户服务，而不是为搜索引擎服务，迎合搜索引擎，满足用户需求，这是在实践中总结出来的道理。</p>
			<p>四、理性分析，认真学习，按需利用</p>
			<p>其实做SEO的工作大概都有这样一种想法，作弊和非作弊有的时候就是差之毫厘，失之千里，百度的这次大封杀也许让更多SEO人对搜索引擎优化有了更深刻和理性地认识。</p>
			<p>网上流传着白帽和黑帽的说法，突然联想到改革开放初盛行的那句“不管白猫黑猫，抓到老鼠的就是好猫”。呵呵，如果SEO真的像抓老鼠那样的话，那大概很多人可以安心的睡大觉了。</p>
			<p>从关键词的选择，网站页面的设计，网站框架的架构，关键词和网页描述，网站内容的定位和完善等多方面入手，SEO并不仅仅是要了解搜索引擎优化的原理，懂得这项技术，而是要将技术和艺术，实用和美观一次又一次地完美结合，需要用心去构思，并细心地跟踪处理每一个细节，这就是我眼中的SEO工作。</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>