<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib uri="/struts-tags" prefix="s" %>
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>分析搜索引擎的计算规则-懒人工具-懒人网站助手中文关键字分析与挖掘</title>
<meta name="keywords" content="网站优化,网络，搜索引擎" />
<meta name="description" content="关键词的选择，网站页面的设计，网站框架的架构，关键词和网页描述，网站内容的定位和完善等多方面入手，SEO并不仅仅是要了解搜索引擎优化的原理，懂得这项技术，而是要将技术和艺术，实用和美观一次又一次地完美结合，需要用心去构思，并细心地跟踪处理每一个细节" />
</head>
<body>
<div class="main">
	<div class="news">
		<div class="column">
			<h1>分析搜索引擎的计算规则</h1>
			<em class="postInfo"><a title="View all posts by 懒人空间" href="http://www.lrtool.net/">懒人工具</a> 发表于: 2011-04-01 | 发表在: <a rel="category tag" title="查看 懒人空间的全部文章" href="/lrspace.html">懒人关键字挖掘</a>  | Tags: 网站优化分析</em>
			<p>搜索引擎的计算是大家做优化的时候不得不去研究的问题，也是SEOER必须掌握和了解的基本知识，许多SEO高手也是从这一步开始的，经过长时间的积累和归纳而逐渐形成一套自己的优化技巧，这种优化技巧就成为了高手们压箱底的资源，SEO本就是暗箱操作的商业机密，所以这些技巧是很难被翻出来公之于众的!如果我们要深入的了解SEO的秘密，必须对搜索引擎的计算规则有一个透彻的了解!</p>
			<p>大家也不要太高估了搜索引擎的智商，这样不利于对SEO的学习，其实搜索引擎是很笨的，我们打个很简单的比方，你在搜索引擎中输入“老师”这个词，搜索引擎就会给出精确的关于老师这个词的检索列表，而不会给出“教师”这个词的检索信息，但是在我们看来老师和教师两个词的意思是完全一样的。这说明了一个什么问题，这就证明现在的搜索引擎还远远达不到对语意相关的检索能力，而只能匹配词性相关的检索信息。</p>
			<p>搜索引擎自身也是在不断的学习，但是这些基本的计算规则只会不断的完善和沿用而不会被丢弃，大家都知道在搜索引擎中随便输入什么内容，哪怕是一个标点符号，它都会给你一个检索列表。这说明搜索引擎的数据库中储存了大量相关信息和精确的关键词，正因为在它的数据库中有这样的精确词语存在(如世界各地的地名，古今名人的名字，动植物等)所以搜索引擎会在1秒之内匹配出精确的信息供浏览者查询!</p>
			<p>了解了这些，我们就能更好针对关键词来进行优化，关键词很狭隘也很泛泛，狭隘的就不多说了就是精确的关键词。关键词泛泛的意义在于它首先是一个输入词，然后通过搜索引擎的计算成为检索词，然后成为相关关键词，最终得到精确关键词!这就需要大家明白关键词它在一定的时候是一个变量而不是一个常量!许多站长都知道关键词但是又不能正确的定义关键词，这里我把关键词在针对不同的对象时分为四种：</p>
			<p>(1)针对优化而言，搜索针对某个页面建立的索引，我们称为关键词!<br/>
　　(2)针对可户而言，带来销售行为的词，叫关键词!<br/>
　　(3)针对网赚站长而言，能带来流量并转化为收益的词就是关键词!<br/>
　　(4)针对新闻而言，能表达最近信息的语句词语叫做关键词</p>
			<p>明白了这些之后我们在对自己要优化的关键词就有了一个定向，这是非常重要的，这样我就就可以合理的针对我们要优化的词去分配和布局，这样去做，你就站在了搜索引擎的角度而不是站在自己网站的角度，为优化而优化和为浏览者优化是不同的两个概念，一个天上一个地下!</p>
		</div>
		<!-- <div class="relat">
			<h3>更多相关链接：</h3>
			<ul>
				<li><a href="#" target="_blank"><s:property value="news.title"/></a></li>
			</ul>
		</div> -->
	</div>
</div>
</body>
</html>